Revit 2027 API
FabricationPart.ItemCustomId Property
 The item custom identifier for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ItemCustomId { get; }
Public ReadOnly Property ItemCustomId As Integer
	Get
public:
property int ItemCustomId {
	int get ();
}
member ItemCustomId : int with get
Property Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace